doc/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-09 vie 17:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jreynoso" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2758ee5">1. A sample project in Common Lisp</a></li>
<li><a href="#org169ff6f">2. Create the project</a></li>
<li><a href="#org5d4b070">3. First we need to load quickproject</a></li>
<li><a href="#org8a0c139">4. Create the project called metl under the directory ~/src/lisp/</a></li>
<li><a href="#orga933375">5. Create the src directory under ~/src/lisp/metl/</a></li>
<li><a href="#org964eaf9">6. Create the directories under ~/src/lisp/metl/src/</a></li>
<li><a href="#org0af708b">7. Create the directories under ~/src/lisp/metl/src/app/</a></li>
<li><a href="#org1dc6452">8. Move  metl.lisp package.lisp files to src directory</a></li>
<li><a href="#org8565c60">9. Working with ASD</a></li>
<li><a href="#org4eaf8b2">10. Load the project</a></li>
<li><a href="#orgbe88f44">11. Use the package</a></li>
<li><a href="#orgb620290">12. Start the web server</a>
<ul>
<li><a href="#orga5a011b">12.1. Open you browser:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2758ee5" class="outline-2">
<h2 id="org2758ee5"><span class="section-number-2">1</span> A sample project in Common Lisp</h2>
</div>
<div id="outline-container-org169ff6f" class="outline-2">
<h2 id="org169ff6f"><span class="section-number-2">2</span> Create the project</h2>
</div>
<div id="outline-container-org5d4b070" class="outline-2">
<h2 id="org5d4b070"><span class="section-number-2">3</span> First we need to load quickproject</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
(ql:quickload "quickproject")
To load "quickproject":
  Load 1 ASDF system:
    quickproject
; Loading "quickproject"

("quickproject")

</pre>
</div>
</div>
<div id="outline-container-org8a0c139" class="outline-2">
<h2 id="org8a0c139"><span class="section-number-2">4</span> Create the project called metl under the directory ~/src/lisp/</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">

(quickproject:make-project #p"~/src/lisp/metl/" :depends-on '(hunchentoot yaclml parenscript postmodern))

"metl"
</pre>

<p>
quickproject has created some files:
</p>
<ul class="org-ul">
<li>metl.asd</li>
<li>metl.lisp</li>
<li>package.lisp</li>
<li>README.md</li>
</ul>
</div>
</div>

<div id="outline-container-orga933375" class="outline-2">
<h2 id="orga933375"><span class="section-number-2">5</span> Create the src directory under ~/src/lisp/metl/</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
mkdir src 

</pre>
</div>
</div>

<div id="outline-container-org964eaf9" class="outline-2">
<h2 id="org964eaf9"><span class="section-number-2">6</span> Create the directories under ~/src/lisp/metl/src/</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
cd src

mkdir app web-server

</pre>
</div>
</div>

<div id="outline-container-org0af708b" class="outline-2">
<h2 id="org0af708b"><span class="section-number-2">7</span> Create the directories under ~/src/lisp/metl/src/app/</h2>
<div class="outline-text-2" id="text-7">
<pre class="example">
cd ~/src/lisp/metl/src/app/

mkdir model view controller
</pre>
</div>
</div>

<div id="outline-container-org1dc6452" class="outline-2">
<h2 id="org1dc6452"><span class="section-number-2">8</span> Move  metl.lisp package.lisp files to src directory</h2>
<div class="outline-text-2" id="text-8">
<pre class="example">
cd ~/src/lisp/metl
cp metl.lisp package.lisp src
</pre>
</div>
</div>
<div id="outline-container-org8565c60" class="outline-2">
<h2 id="org8565c60"><span class="section-number-2">9</span> Working with ASD</h2>
<div class="outline-text-2" id="text-9">
<p>
ASDF is what Common Lisp hackers use to build and load software.
</p>

<p>
ASDF is the build system. It lets you define projects
 – called systems – along with their metadata, dependencies, their 
source code files, and the order in which those files are loaded.
</p>

<p>
Modules are directories, and files are Lisp files.
</p>

<p>
For intance in ASDF
:module :src  is src directory
</p>

<p>
and
</p>

<p>
(:file "a-file") is a lisp file
</p>

<p>
so the met.asd file has:
</p>

<pre class="example">
(asdf:defsystem #:metl
  :description "A sample project in Common Lisp"
  :author "Juan Reynoso juan@ikkiware.com"
  :maintainer "Juan Reynoso juan@ikkiware.com"
  :license "MIT"
  :version "0.0.1"
  :homepage "https://github.com/juan-reynoso/metl"
  :serial t
  :depends-on (#:hunchentoot #:yaclml #:parenscript #:postmodern)
  :components (
	       ;; src directory
	       (:module :src 
		:components
		((:file "package")
		 (:file "metl")
		 ;; web-server directory
		 (:module :web-server
		  :components
		  ((:file "web-server")))
		 ;; /src/app directory
		 (:module :app
		  :components
		  (;; /src/app/model/ directory
		   (:module :model 
		    :components
			    ((:file "model")))
		   ;; /src/app/view/ directory
		   (:module :view 
		    :components
			    ((:file "with-html")
			     (:file "index")
			     (:file "ajax-example")))
		   ;; /src/app/controller/ directory
		   (:module :controller 
		    :components
			    ((:file "controller")))))))))
</pre>

<p>
If you explore each directory you will see some lisp files.
</p>
</div>
</div>

<div id="outline-container-org4eaf8b2" class="outline-2">
<h2 id="org4eaf8b2"><span class="section-number-2">10</span> Load the project</h2>
<div class="outline-text-2" id="text-10">
<pre class="example">
(ql:quickload "metl")
To load "metl":
  Load 1 ASDF system:
    metl
; Loading "metl"
[package metl]
("metl")
</pre>
</div>
</div>

<div id="outline-container-orgbe88f44" class="outline-2">
<h2 id="orgbe88f44"><span class="section-number-2">11</span> Use the package</h2>
<div class="outline-text-2" id="text-11">
<pre class="example">
(in-package :metl)
</pre>
</div>
</div>

<div id="outline-container-orgb620290" class="outline-2">
<h2 id="orgb620290"><span class="section-number-2">12</span> Start the web server</h2>
<div class="outline-text-2" id="text-12">
<pre class="example">
(start-web-server)
</pre>
</div>

<div id="outline-container-orga5a011b" class="outline-3">
<h3 id="orga5a011b"><span class="section-number-3">12.1</span> Open you browser:</h3>
<div class="outline-text-3" id="text-12-1">
<p>
<a href="http://localhost:8090/index.html">http://localhost:8090/index.html</a>
or
<a href="http://localhost:8090/ajax-example.html">http://localhost:8090/ajax-example.html</a>
</p>
<pre class="example">

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jreynoso</p>
<p class="date">Created: 2021-07-09 vie 17:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
